
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_УсловияАбонентскогоДоговора.Видимость = Истина;
	Иначе
		Элементы.ВКМ_УсловияАбонентскогоДоговора.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВидДоговораОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ВидДоговораОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Если ВыбранноеЗначение = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_УсловияАбонентскогоДоговора.Видимость = Истина;
	Иначе
		Элементы.ВКМ_УсловияАбонентскогоДоговора.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
