#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Функция КонтрольЗаполненияФормы()
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Возврат Ложь;
		ОбщегоНазначения.СообщитьПользователю("Поле ""Период "" не заполнен");
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Сформировать(Команда)
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Документы не будут созданы , если по договору были созданы документы вручную. 
       				              |Продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Если Не КонтрольЗаполненияФормы() Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьДлительнуюОперацию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДлительнуюОперацию() Экспорт

	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении);

КонецПроцедуры
&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере()
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Обработки.ВКМ_МассовоеСозданиеАктов.ТяжелаяОперация", Объект.Период);
	Возврат ДлительнаяОперация;

КонецФункции

&НаСервере
Процедура ОповещениеОЗавершении(Результат, ДполнительныеПарметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда
		Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			ЗаполнитьТаблицуОбработки(Результат);
		ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбработки(МассивДанных)
	Объект.ДоговорыИРеализацииЗаПериод.Очистить();
	Для Каждого Стр Из МассивДанных Цикл
		НоваяСтрокаТЧ = Объект.ДоговорыИРеализацииЗаПериод.Добавить();
		НоваяСтрокаТЧ.Договор = Стр.Договор;
		НоваяСтрокаТЧ.Реализация = Стр.Ссылка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти