#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	РезультатПроверки =  ДокументОбъект.ПроверкаДокументаНаИзменение(ДокументОбъект.Ссылка, ПараметрыЗаписи.ДатаПроведенияРабот, ПараметрыЗаписи.ВремяНачалаРабот, ПараметрыЗаписи.ВремяОкончанияРабот, ПараметрыЗаписи.Специалист);
	ТекстСообщения = ДокументОбъект.СформироватьТекстСообщенияТелеграм(РезультатПроверки);
	Если ТекстСообщения <> Неопределено Тогда
		ДокументОбъект.СоздатьЗаписьВСправочникСообщенияТелеграм(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка,"ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРабот, ВКМ_ВремяОкончанияРабот, ВКМ_Специалист");
	ПараметрыЗаписи.Вставить("ДатаПроведенияРабот", ЗначенияРеквизитов.ВКМ_ДатаПроведенияРабот);
	ПараметрыЗаписи.Вставить("ВремяНачалаРабот", ЗначенияРеквизитов.ВКМ_ВремяНачалаРабот);
	ПараметрыЗаписи.Вставить("ВремяОкончанияРабот", ЗначенияРеквизитов.ВКМ_ВремяОкончанияРабот);
	ПараметрыЗаписи.Вставить("Специалист", ЗначенияРеквизитов.ВКМ_Специалист);

КонецПроцедуры
#КонецОбласти