Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Начисление,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ДатаНачала,
		|	КонецПериода(ВКМ_НачислениеЗаработнойПлатыНачисления.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ГрафикРаботы,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Категория,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Ссылка.МесяцНачисления КАК ПериодРегистрации
		|ПОМЕСТИТЬ втНачисления
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.Начисления КАК ВКМ_НачислениеЗаработнойПлатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНачисления.Сотрудник,
		|	втНачисления.Начисление КАК ВидРасчета,
		|	втНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	втНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	втНачисления.ДатаНачала КАК БазовыйПериодНачало,
		|	втНачисления.ДатаОкончания КАК БазовыйПериодКонец,
		|	втНачисления.ГрафикРаботы КАК График,
		|	втНачисления.Категория,
		|	втНачисления.ПериодРегистрации,
		|	естьnull(ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних.Оклад, 0) как Параметр
		|ИЗ
		|	втНачисления КАК втНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_СведенияДляРасчетаЗарплаты.СрезПоследних(&НаДату, (Категория, Сотрудник) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				втНачисления.Категория,
		|				втНачисления.Сотрудник
		|			ИЗ
		|				втНачисления КАК втНачисления)) КАК ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних
		|		ПО втНачисления.Сотрудник = ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних.Сотрудник
		|		И втНачисления.Категория = ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних.Категория";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НаДату", МесяцНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Параметр = 0 Тогда
			Отказ = Истина;
			// текст пользователю
		КонецЕсли;
			
		НовСтрока = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетальныеЗаписи);		
		НовСтрока.Сторно = Ложь;		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Записать();

	//ВКМ_РасчетЗарплаты.РассчитатьОсновныеНачисления(Ссылка, Движения.ВКМ_ОсновныеНачисления);
	//// регистр ВКМ_Удержания
	//Движения.ВКМ_Удержания.Записывать = Истина;
	//Движение = Движения.ВКМ_Удержания.Добавить();
	//Движение.Сторно = Ложь;

КонецПроцедуры