Функция ОтправкаСообщенияВТелеграм(ТекстСообщения) Экспорт
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	Данные = новый структура;
	Данные.Вставить("chat_id",Константы.ВКМ_ИдентификаторГруппыОповещения.Получить());
	Данные.Вставить("text", ТекстСообщения);
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Строказапроса = ЗаписьJSON.Закрыть();
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	Запрос=Новый HTTPЗапрос("bot"+Константы.ВКМ_ТокенТелеграмБота.Получить()+"/sendMessage", Заголовки);
	Запрос.УстановитьТелоИзСтроки(Строказапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Возврат Ответ.КодСостояния;
КонецФункции

Процедура ПереборСообщенийДляОтправки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ВКМ_ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВКМ_ТелеграмКлиентСервер.ОтправкаСообщенияВТелеграм(ВыборкаДетальныеЗаписи.ВКМ_ТекстСообщения) = 200 Тогда
			ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект().Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

