
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресВХ = Параметры.АдресВХ;

	ТЗСотрудники = ПолучитьИзВременногоХранилища(АдресВХ);
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");

	Для Каждого Строка Из ТЗСотрудники Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти



