#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ТяжелаяОперация(Период) Экспорт

	СписокДоговоров = СпискоДоговоровДляАктов(Период);

	Если СписокДоговоров.Пустой() Тогда
		ТекстШаблона = "За выбранный период данных нет";
		ОбщегоНазначения.СообщитьПользователю(ТекстШаблона);
		Возврат ТекстШаблона;
	Иначе
		ТаблицаДоговоров = СписокДоговоров.Выгрузить();
		МассивДанных = СоздатьДокументыРеализацияТоваровИУслуг(ТаблицаДоговоров, Период);
	КонецЕсли;

	Возврат МассивДанных;

КонецФункции

Функция СпискоДоговоровДляАктов(Период)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор
	|ПОМЕСТИТЬ ВТ_ДокументРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцОтчета, Месяц) И КОНЕЦПЕРИОДА(&МесяцОтчета, Месяц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия >= НАЧАЛОПЕРИОДА(&МесяцОтчета, Месяц)
	|	И НЕ ДоговорыКонтрагентов.Ссылка В
	|		(ВЫБРАТЬ
	|			ВТ_ДокументРеализации.Договор КАК Договор
	|		ИЗ
	|			ВТ_ДокументРеализации КАК ВТ_ДокументРеализации)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия <= КОНЕЦПЕРИОДА(&МесяцОтчета, Месяц)";

	Запрос.УстановитьПараметр("МесяцОтчета", Период);

	Возврат Запрос.Выполнить();

КонецФункции

Функция СоздатьДокументыРеализацияТоваровИУслуг(ТаблицаДоговоров, Период)

	МассивДанных = Новый Массив;

	Для Каждого Док Из ТаблицаДоговоров Цикл

		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДатаДокумента = ТекущаяДатаСеанса();
		Документ.Дата = ?(ДатаДокумента > КонецМесяца(Период), КонецМесяца(Период), ДатаДокумента);
		Документ.Организация = Док.Договор.Организация;
		Документ.Контрагент = Док.Договор.Владелец;
		Документ.Ответственный = Пользователи.ТекущийПользователь();
		Документ.Основание = Док.Договор;
//		Документ.Комментарий = СтрШаблон("Услуги за период с %1 по %2", Формат(НачалоМесяца(МесяцОтчета),
//			"ДФ=dd.MM.yyyy;"), Формат(КонецМесяца(МесяцОтчета), "ДФ=dd.MM.yyyy;"));
		ЗаполнитьЗначенияСвойств(Документ, Док);
		Документ.Записать(РежимЗаписиДокумента.Запись);
		Документ.ВыполнитьАвтозаполнение();;
		Документ.Записать(РежимЗаписиДокумента.Запись);
		Если Документ.ПроверитьЗаполнение() Тогда
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не проведен. %1 не прошел проверку на заполнение",
				Документ.Ссылка));
		КонецЕсли;

		МассивДанных.Добавить(Документ.Ссылка);

	КонецЦикла;

	Возврат МассивДанных;

КонецФункции

#КонецОбласти

#КонецЕсли