
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если НЕ Объект.Ссылка = Документы.ВКМ_ВыплатаЗарплаты.ПустаяСсылка() Тогда 
		ОбъектФормы = РеквизитФормыВЗначение("Объект");
		ОбъектФормы.ОчисткаРегистра();
		
		ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Объект.ВКМ_Выплаты.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.ВКМ_Выплаты.Добавить();
		НоваяСтрока.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.ВКМ_Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
