
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ВКМ_ГрафикРабот.Установить(График);
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ВКМ_Дата = Дат;
		Запись.ВКМ_ГрафикРабот = График;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ВКМ_Дни = 0;
			Запись.ВКМ_Часы = 0;
		Иначе	          
			Запись.ВКМ_Дни = 1;
			Запись.ВКМ_Часы = 8;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	
	Набор.Записать();
	
КонецПроцедуры
